{
  "id": "LazyCowboy.SwordMod",
  "name": "Sword Mod",
  "version": "1.0.5",
  "authors": "LazyCowboy",
  "description": "Adds sword, like spear but better.<LINE><LINE>Now with Rain Meadow PvP support!! Go battle your friends online! (More Slugcats Expansion is extremely recommended)<LINE><LINE>NOTE: THIS ITEM DOES NOT SPAWN NATURALLY! If you want to be able to obtain swords in your playthrough, use the spawn settings in the config menu for this mod, or spawn it in sandbox, or use the Sword expedition perk.<LINE><LINE>(Update 1.0.3: Added optional stamina mechanics that can be enabled in the Extras tab. Also made minor improvements to the parry mechanic and the sounds.)<LINE><LINE>If you couldn't guess by now, this is a bit of a joke mod; but that didn't stop me from wanting to make it decent quality. The sword is an absurdly effective weapon against any creature, but it's not unbeatable. Have fun slicing up every creature in sight, though!<LINE><LINE>Sword Mechanics:<LINE>* Press throw to attack using the sword (this technically throws the sword, holds it in front of your slugcat, then returns it to your hand if it is still empty).<LINE>* Swinging the sword in mid-air will give you a boost in the direction of your swing, allowing for some fun movement.<LINE>* Swords can deflect thrown weapons and parry other swords, allowing for some PvP combat.<LINE>* Dual-wielding is not intended, but it's funny. Dual-wielding swords can be disabled in the config menu.<LINE>* Using the sword factors in your input directions:<LINE>    - Swinging upward will flip many creatures over.<LINE>    - Slicing downward will stun creatures for much longer.<LINE>    - Stabbing forward has the longest reach and transfers your momentum.<LINE>* Most arbitrary numbers in my code are modifiable in the config menu, so feel free to modify them to your liking.<LINE><LINE>PVP + EXTRAS:<LINE>* Increase the parry window so players will have more time to react in a fight (but don't make it more than half the swing time).<LINE>* Decrease the damage and stun modifiers, so that one hit with a sword isn't instant-death.<LINE>* Increasing the pushback amounts will improve the feel of combat, since it's harder to run straight through someone's defense.<LINE>* Enabling stamina mechanics discourages button mashing by causing swings to become weaker, shorter, and more parry-able if used repeatedly; and consecutive swings can even cause exhaustion (like Gourmand).<LINE>    -(Note: Slugcats' in-game stamina meter is increased by actions such as running and especially jumping, so it's possible to become exhausted after only 1 swing if the slugcat is already tired.)<LINE>* Enabling omnidirectional swings and vertical pushback > 1.5 allow for Hollow-Knight-style pogos and vertical attacks.<LINE><LINE>Check out kitsu ||'s Nail Mod texture + sound effects!<LINE>If any modder wants to use this item for anything, it's ID is \"SwordMod_Sword\".<LINE><LINE>KNOWN ISSUES:<LINE>* The sword frequently doesn't appear in shelters when first loading a save. This can be fixed by immediately exiting to menu and re-entering that slugcat's save.",
  "requirements": [],
  "requirements_names": [],
  "tags": ["Items", "Game Mechanics"],
  "checksum_override_version": false
}
